#!/bin/bash

fon_first=""
text_first=""
fon_second=""
text_second=""

. ./output.sh

if [[ $# == 0 ]] || [[ $# != 4 ]]; then
  echo "Ошибка! Пожалуйста, введите 4 цифры: от 1 до 6"
  exit 1
fi

echo "Ваш первый параметр: $1"
echo "Ваш второй параметр: $2"
echo "Ваш третий параметр: $3"
echo "Ваш четвертый параметр: $4"

if [[ "$1" == "$2" ]] || [[ "$3" == "$4" ]]; then
    echo "Ошибка! Цвета шрифта и фона одного столбца не должны совпадать. Введите заново значения параметров"
    exit 1
fi

parser1 $1
parser2 $2
parser3 $3
parser4 $4

output $1 $2 $3 $4
